import math

print("Оберіть спосіб обрахунку площі трикутника: " + "\n1. За допомогою формули Герона." + "\n2. За висотою." +
      "\n3. За двома сторонами і кутом між ними.")

method_number = int(input("Введіть номер способу: "))

if method_number == 1:
    a, b, c = map(float, input("Введіть довжини сторін трикутника (через пробіл): ").split())
    p = (a+b+c)/2
    S = (p*(p-a)*(p-b)*(p-c))**(1/2)
    print("Площа трикутника дорівнює: " + str(S) + " см.кв.")

elif method_number == 2:
    a, h = map(float, input("Введіть довжину сторони трикутника та висоту (через пробіл): ").split())
    S = 1/2*a*h
    print("Площа трикутника дорівнює: " + str(S) + " см.кв.")

else:
    a, b, angle = map(float, input("Введіть довжини сторін трикутника та кут між ними (через пробіл): ").split())
    S = 1/2*a*b*math.sin(math.radians(angle))
    print("Площа трикутника дорівнює: " + str(S) + " см.кв.")
